#### Pandas

##### Serirs 01

In [1]:
import numpy as np
import pandas as pd

In [2]:
li = ['shubham','abhi','akash']

In [3]:
a = pd.Series(li)

In [4]:
a

0    shubham
1       abhi
2      akash
dtype: object

In [7]:
a = pd.Series(li,index="A B C". split())

In [8]:
a

A    shubham
B       abhi
C      akash
dtype: object

In [9]:
li = ["Sullah","Palampur","Thulel"]

In [10]:
a = pd.Series(li)

In [11]:
a

0      Sullah
1    Palampur
2      Thulel
dtype: object

In [25]:
a = pd.Series([50,20,60], index="A B C".split(), name="marks")

In [26]:
a

A    50
B    20
C    60
Name: marks, dtype: int64

In [27]:
s = pd.Series([30,30,30],index="A B C".split(), name="Company")

In [28]:
s

A    30
B    30
C    30
Name: Company, dtype: int64

In [29]:
s * 2

A    60
B    60
C    60
Name: Company, dtype: int64

In [30]:
s/2

A    15.0
B    15.0
C    15.0
Name: Company, dtype: float64

In [31]:
s+3

A    33
B    33
C    33
Name: Company, dtype: int64

In [32]:
s

A    30
B    30
C    30
Name: Company, dtype: int64

In [33]:
li = ["Sullah","Palampur","Thulel"]

In [38]:
a = pd.Series([500,450,400],index="1 2 3".split(),name = "Places",)

In [39]:
a

1    500
2    450
3    400
Name: Places, dtype: int64

##### DataFrame

In [40]:
a = ["ujwal","sahil","saransh","harjeet"]

In [48]:
pd.DataFrame(a)

      0
20  NaN
292 NaN
38  NaN

In [53]:
pd.DataFrame([20,292,38])

     0
0   20
1  292
2   38

In [55]:
b = ["ujwal","harjeet","sahil","saransh"]

In [56]:
b = pd.DataFrame(b, index=["A B C D".split()], columns = ["Bhaichara"])

In [57]:
b

  Bhaichara
A     ujwal
B   harjeet
C     sahil
D   saransh

In [58]:
a = ["ujwal","varsha","sahil","diksha"]

In [69]:
pd.DataFrame(a,index=["A B C D".split()],columns = ["Performance"])

  Performance
A       ujwal
B      varsha
C       sahil
D      diksha

In [79]:
d = {
    1:["ujwal",20,'netmax',65],
    2:["harjeet",21,'netmax',63],
    3:["sahil",22,'netmax',69]
}

In [80]:
pd.DataFrame(d)

        1        2       3
0   ujwal  harjeet   sahil
1      20       21      22
2  netmax   netmax  netmax
3      65       63      69

In [85]:
pd.DataFrame(d).T

         0   1       2   3
1    ujwal  20  netmax  65
2  harjeet  21  netmax  63
3    sahil  22  netmax  69

In [93]:
d = pd.DataFrame(d).T

In [96]:
pd.DataFrame(d,index= "A B C D ".split())

     0    1    2    3
A  NaN  NaN  NaN  NaN
B  NaN  NaN  NaN  NaN
C  NaN  NaN  NaN  NaN
D  NaN  NaN  NaN  NaN